#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначения.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Интеграция1СБухфон
	Если ПравоДоступа("Просмотр", Метаданные.ОбщиеКоманды.Запустить1СБухфон) Тогда
		Интеграция1СБухфон.ПриСозданииНаСервере(Элементы.ОбщаяКомандаЗапустить1СБухфон);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Интеграция1СБухфон
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	// СтандартныеПодсистемы.Интеграция1СБухфон
	Если Элементы.Найти("ОбщаяКомандаЗапустить1СБухфон") <> Неопределено Тогда
		Интеграция1СБухфонКлиент.ОбработкаОповещения(ИмяСобытия, Элементы.ОбщаяКомандаЗапустить1СБухфон);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Интеграция1СБухфон
	
КонецПроцедуры

#КонецОбласти



