////////////////////////////////////////////////////////////////////////////////
// Демонстрационная конфигурация Библиотеки стандартных подсистем.
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция СформироватьКарточкуОрганизации(СписокОрганизаций, ОбластиОбъектов) Экспорт
	Возврат Обработки._ДемоПечатьКарточкиОрганизации.СформироватьКарточкуОрганизации(СписокОрганизаций, ОбластиОбъектов);
КонецФункции

#КонецОбласти