#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитФормыВЗначение("Объект").НастройкиПоУмолчанию());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПускСКонтролем(Команда)
	ПроверятьЗаполнение = Истина;
	ПускНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПускБезКонтроля(Команда)
	ПроверятьЗаполнение = Ложь;
	ПускНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПускНаКлиенте()
	Результат = ПускНаСервере();
	СтандартныеПодсистемыКлиент.ПоказатьРезультатВыполнения(ЭтотОбъект, Результат);
КонецПроцедуры

&НаСервере
Функция ПускНаСервере()
	Возврат РеквизитФормыВЗначение("Объект").Сгенерировать(ЭтотОбъект);
КонецФункции

#КонецОбласти
