
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Демо: Стандартные подсистемы".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

//////////////////////////////////////////////////////////////////////////////
// Обработчики событий подписок для документов "_Демо".

Процедура _ДемоЗаполнитьДатуДокументаПоРабочейДатеОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Источник.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

КонецПроцедуры

Процедура _ДемоЗаполнитьДатуДокументаПоРабочейДатеПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	Источник.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////
// Обработчики событий записи констант.

Процедура ИспользоватьДополнительныеОтчетыИОбработкиПриЗаписи(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Или ОбменДаннымиПовтИсп.ЭтоАвтономноеРабочееМесто() Тогда
		Возврат;
	КонецЕсли;
	Если Источник.Значение = Истина Тогда
		_ДемоОбновлениеИнформационнойБазыБСП.ЗагрузитьДополнительныеОтчетыИОбработкиИзОбщихМакетов();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
