////////////////////////////////////////////////////////////////////////////////
// Демонстрационная конфигурация Библиотеки стандартных подсистем.
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Реализация события ОбработкаПолученияФормы элемента справочника Организации.

Процедура _ДемоПереопределитьФормуОрганизацииОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Справочник.Организации.Форма._ДемоФормаЭлемента";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
