////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторОбращения = Параметры.ИдентификаторОбращения;
	
	ЗаполнитьНепросмотренныеВзаимодействия();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура НепросмотренныеВзаимодействияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ИнформационныйЦентрКлиент.ОткрытьВзаимодействиеВСлужбуПоддержки(ИдентификаторОбращения, ТекущиеДанные.Идентификатор, ТекущиеДанные.Тип, ТекущиеДанные.Входящее, Ложь);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьНепросмотренныеВзаимодействия()
	
	Для Каждого ЭлементСписка Из Параметры.СписокНеПросмотренныхВзаимодействий Цикл 
		НепросмотренноеВзаимодействие = ЭлементСписка.Значение;
		НоваяСтрокаТЗ = НепросмотренныеВзаимодействия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, НепросмотренноеВзаимодействие);
		НоваяСтрокаТЗ.НомерКартинки = ИнформационныйЦентрСервер.НомерКартинкиПоВзаимодействию(НоваяСтрокаТЗ.Тип, НоваяСтрокаТЗ.Входящее);
		НоваяСтрокаТЗ.ПояснениеККартинке = ?(НоваяСтрокаТЗ.Входящее, НСтр("ru = 'Вх.'"), НСтр("ru = 'Исх.'"));
	КонецЦикла;
	
КонецПроцедуры

