#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Для Каждого СтрокаТовара Из Товары Цикл
		
		ДвижениеПоступленияТовара(СтрокаТовара);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДвижениеПоступленияТовара(Знач СтрокаТовара)
	
	Движение = Движения.ОстаткиТоваров.Добавить();
		
	Движение.Период        = Дата;
	Движение.ВидДвижения   = ВидДвиженияНакопления.Приход;
	Движение.МестоХранения = МестоХранения;
	Движение.Номенклатура  = СтрокаТовара.Номенклатура;
	Движение.Количество    = СтрокаТовара.Количество;
	Движение.Цена = СтрокаТовара.Цена;

КонецПроцедуры


#КонецОбласти

#КонецЕсли