////////////////////////////////////////////////////////////////////////////////
// Подсистема "Текущие дела".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет список обработчиков текущих дел.
//
// Параметры:
//  Обработчики - Массив - массив ссылок на модули менеджеров или общие модули, в которых
//                         определена процедура ПриЗаполненииСпискаТекущихДел.
//
Процедура ПриОпределенииОбработчиковТекущихДел(Обработчики) Экспорт
	
	// _Демо начало примера
	Обработчики.Добавить(Документы._ДемоЗаказПокупателя);
	Обработчики.Добавить(Документы._ДемоСчетНаОплатуПокупателю);
	// _Демо конец примера
	
КонецПроцедуры

// Получает список разделов командного интерфейса в заданном порядке.
//
// Параметры:
//  Разделы - Массив - массив разделов командного интерфейса.
//                     Задает начальный порядок разделов в панели текущих дел.
//
Процедура ПриОпределенииПорядкаРазделовКомандногоИнтерфейса(Разделы) Экспорт
	
	// _Демо начало примера
	Разделы.Добавить(Метаданные.Подсистемы._ДемоУправлениеДоступом);
	Разделы.Добавить(Метаданные.Подсистемы._ДемоСинхронизацияДанных);
	Разделы.Добавить(Метаданные.Подсистемы._ДемоНормативноСправочнаяИнформация);
	Разделы.Добавить(Метаданные.Подсистемы._ДемоОрганайзер);
	Разделы.Добавить(Метаданные.Подсистемы._ДемоСервисныеПодсистемы);
	Разделы.Добавить(Метаданные.Подсистемы._ДемоИнтегрируемыеПодсистемы);
	Разделы.Добавить(Метаданные.Подсистемы._ДемоИнтегрируемыеПодсистемыПродолжение);
	Разделы.Добавить(Метаданные.Подсистемы._ДемоБизнесПроцессыИЗадачи);
	Разделы.Добавить(Метаданные.Подсистемы._ДемоАнкетирование);
	Разделы.Добавить(Метаданные.Подсистемы._ДемоРаботаВМоделиСервиса);
	Разделы.Добавить(Метаданные.Подсистемы._ДемоИнструментыРазработчика);
	Разделы.Добавить(Метаданные.Подсистемы.Администрирование);
	// _Демо конец примера
	
КонецПроцедуры

// Отключает текущие дела.
//
// Параметры:
//  ОтключаемыеДела - Массив - массив строк идентификаторов текущих дел, которые нужно отключать.
//
Процедура ПриОтключенииТекущихДел(ОтключаемыеДела) Экспорт
	
КонецПроцедуры

// Устанавливает общие параметры запросов для расчета текущих дел.
// См. ТекущиеДела.УстановитьОбщиеПараметрыЗапросов().
//
// Параметры:
//  Запрос - выполняемый запрос.
//  ОбщиеПараметрыЗапросов - Структура - общие значения для расчета текущих дел.
//
Процедура УстановитьОбщиеПараметрыЗапросов(Запрос, ОбщиеПараметрыЗапросов) Экспорт
	
КонецПроцедуры

// Процедура-обработчик, вызываемая в форме расшифровки текущего дела.
// Устанавливает параметры открытия формы и необходимые отборы списка формы.
//
// Параметры:
//  Форма - УправляемаяФорма
//  Список - ДинамическийСписок
//
Процедура ПриСозданииНаСервере(Форма, Список) Экспорт
	
КонецПроцедуры

// Процедура-обработчик, вызываемая в форме расшифровки текущего дела.
// Позволяет заменить сохраненные значения реквизитов формы.
// Заменяет сохраненные значения реквизитов формы на свойства Форма.Параметры.СтруктураБыстрогоОтбора.
//
// Параметры:
//  Форма - УправляемаяФорма
//  Настройки - Соответствие
//
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Форма, Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти